---
kind: type
id: T:Autodesk.Revit.DB.UpdaterData
source: html/58751d04-6f56-0346-e7ba-f21e61a459be.htm
---
# Autodesk.Revit.DB.UpdaterData

Service class that is passed to an Updater to prove access to update execution context

## Syntax (C#)
```csharp
public class UpdaterData : IDisposable
```